package cn.wopaipai.event

/*
+--------------+---------------------------------
+ author       +   Catherine Liu
+--------------+---------------------------------
+ since        +   2019-06-11 15:05
+--------------+---------------------------------
+ projectName  +   wopaipaiAndroid
+--------------+---------------------------------
+ packageName  +   cn.wopaipai.Constant
+--------------+---------------------------------
+ description  +   订阅事件：網絡狀態發生變化
+--------------+---------------------------------
+ version      +  
+--------------+---------------------------------
*/

class NetStateChangeEvent(var isConnect: Boolean)