package cn.wopaipai.listener

/*
+--------------+---------------------------------
+ author       +   Catherine Liu
+--------------+---------------------------------
+ since        +   2019-06-14 18:26
+--------------+---------------------------------
+ projectName  +   wopaipaiAndroid
+--------------+---------------------------------
+ packageName  +   cn.wopaipai.listener
+--------------+---------------------------------
+ description  +  回调监听：加载数据的回调
+--------------+---------------------------------
+ version      +  
+--------------+---------------------------------
*/

interface LoadingDataListener {
    //提供此方法触发加载数据的动作
    fun onLoadingData()
}